import { Main } from '../../layouts/main';

import Gift1 from '../../img/giftsImage1.png';
import Gift2 from '../../img/giftsImage2.png';
import Gift3 from '../../img/giftsImage3.png';
import Gift4 from '../../img/giftsImage4.png';

import styles from './styles.module.scss';
import { Box } from '../../common/box';
import { Item } from './item';

export const Gifts = () => {
  return (
    <Main>
      <Box className={styles.header}>Каталог товарів</Box>

      <Item
        image={Gift1}
        header={`Підвіс “Духовна сила”`}
        text="Срібний підвіс оберіг Духовна сила. Універсальний оберег підійде і чоловікові та жінці, які обрали духовний шлях, важкий, але при цьому благодатний. Допомагає концентрації духу та збереженню самовладання."
      />
      <Item
        image={Gift2}
        header={`Статуетка “Святобор”`}
        text="Святобор – бог лісу. Зовні він виглядає як постарілий богатир, старий міцної статури, має густу бороду і одягнений в звірині шкури. Одружений Святобор на богині полювання Девані."
        isReverse
      />
      <Item
        image={Gift3}
        header={`Книга “Українська міфологія”`}
        text="Ця книжка знайомить з чарівним світом української міфології, з історією слов’янських племен, з багатством народних обрядів, ритуалів і оберегів."
      />
      <Item
        image={Gift4}
        header={`Оберіг “Зірка Лади”`}
        text="Оберіг, який дарує сімейну гармонію. Зірка Лади - Богородиці в собі поєднала природні і божественні сили.Уособлюючи собою родючість і жіноче начало, він допомагає дівчатам і жінкам, які мріють про створення міцної і щасливої родини."
        isReverse
      />
    </Main>
  );
};
